In [1]:
# Basic Python package!!!!!
import pandas as pd
import numpy as np

In [3]:
df =  pd.read_csv(r"d:\Downloads\titanic.csv")

In [4]:
df.duplicated().sum()

np.int64(0)

In [5]:
df.drop(columns=['Cabin'],axis=1,inplace=True)

In [6]:
df.drop(columns=['PassengerId','Name', 'Ticket'],axis=1,inplace=True)
df.sample(5)

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
331         0       1    male  45.5      0      0  28.5000        S
72          0       2    male  21.0      0      0  73.5000        S
613         0       3    male   NaN      0      0   7.7500        Q
784         0       3    male  25.0      0      0   7.0500        S
9           1       2  female  14.0      1      0  30.0708        C

In [7]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
df['Family']=df['SibSp']+df['Parch']+1
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  Family
0         0       3    male  22.0      1      0   7.2500        S       2
1         1       1  female  38.0      1      0  71.2833        C       2
2         1       3  female  26.0      0      0   7.9250        S       1
3         1       1  female  35.0      1      0  53.1000        S       2
4         0       3    male  35.0      0      0   8.0500        S       1

In [9]:
df['Age'].fillna(df['Age'].median(), inplace=True)
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

C:\Users\vbara\AppData\Local\Temp\ipykernel_30128\2359842934.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)
C:\Users\vbara\AppData\Local\Temp\ipykernel_30128\2359842934.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [10]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [11]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare Embarked  Family
0         0       3    0  22.0      1      0   7.2500        S       2
1         1       1    1  38.0      1      0  71.2833        C       2
2         1       3    1  26.0      0      0   7.9250        S       1
3         1       1    1  35.0      1      0  53.1000        S       2
4         0       3    0  35.0      0      0   8.0500        S       1

In [12]:
df.shape

(891, 9)

In [13]:
from sklearn.preprocessing import StandardScaler

# Standardize the 'Age' and 'Fare' columns
scaler = StandardScaler()
df[['Age', 'Fare']] = scaler.fit_transform(df[['Age', 'Fare']])

In [14]:
df.head()

   Survived  Pclass  Sex       Age  SibSp  Parch      Fare Embarked  Family
0         0       3    0 -0.565736      1      0 -0.502445        S       2
1         1       1    1  0.663861      1      0  0.786845        C       2
2         1       3    1 -0.258337      0      0 -0.488854        S       1
3         1       1    1  0.433312      1      0  0.420730        S       2
4         0       3    0  0.433312      0      0 -0.486337        S       1

In [17]:
from sklearn.preprocessing import LabelEncoder

# Encode all object (categorical) columns
label_encoders = {}
for col in df.columns:
    if df[col].dtype == 'object':
        le = LabelEncoder()
        df[col] = le.fit_transform(df[col].astype(str))
        label_encoders[col] = le

In [19]:
# Correlation Matrix
corm = df.corr(numeric_only=True)
print('Correlation Matrix:')
print(corm['Survived'].sort_values(ascending=False))

print('\n')

# Feature Selection using Random Forest
from sklearn.ensemble import RandomForestClassifier

# Define the model
model = RandomForestClassifier()
x = df.drop('Survived', axis=1)
y = df['Survived']
model.fit(x , y)

# Get feature importances
feature_importances = pd.Series(model.feature_importances_, index=x.columns)
print('Feature Importances:')
print(feature_importances.sort_values(ascending=False))

Correlation Matrix:
Survived    1.000000
Sex         0.543351
Fare        0.257307
Parch       0.081629
Family      0.016639
SibSp      -0.035322
Age        -0.064910
Embarked   -0.167675
Pclass     -0.338481
Name: Survived, dtype: float64


Feature Importances:
Fare        0.265710
Sex         0.257893
Age         0.252331
Pclass      0.082100
Family      0.052906
Embarked    0.034319
SibSp       0.030272
Parch       0.024468
dtype: float64